Studier.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>(Studier)</title>
<link rel="stylesheet" href="./reveal.js/css/reveal.min.css"/>
<link rel="stylesheet" href="./reveal.js/css/theme/night.css" id="theme"/>
<link rel="stylesheet" href="./bigsource.css"/>
<link rel="stylesheet" href="./reveal.js/css/print/pdf.css" type="text/css" media="print"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<h1>Studier</h1>
<h2></h2>
<h2><a href="mailto:"></a></h2>
<h2></h2></section>
\begin{equation}
\def\sfrac#1#2{%
    \raise.75ex{\small#1}%
    \kern-.15em/\kern-.15em%
    \lower.25ex{\small#2}}
\end{equation}

<section>
<section id="sec-1" >

<h2><span class="section-number-2">1</span> Bachelorprogrammer</h2>
<ul class="org-ul">
<li><a href="https://www.uio.no/studier/program/inf-design/">Design, bruk og interaksjon</a>
</li>
<li><a href="https://www.uio.no/studier/program/inf-nor/">Nanoelektronikk og robotikk</a>
</li>
<li><a href="https://www.uio.no/studier/program/inf-pro/">Programmering og nettverk</a>
</li>
<li><a href="https://www.uio.no/studier/program/inf-sprok/">Språk og kommunikasjon</a>
</li>
</ul>
</section>
</section>
<section>
<section id="sec-2" >

<h2><span class="section-number-2">2</span> Design, bruk og interaksjon</h2>
<p>
Design av systemer
</p>

</section>
<section id="sec-2-1" >

<h3><span class="section-number-3">2.1</span> Hva lærer du?</h3>
<ul class="org-ul">
<li>Design av programvare
</li>
<li>Hvordan gjøre programmer brukervennlige
</li>
<li>Hvordan finne fram til det brukerne vil ha
</li>
</ul>
</section>
</section>
<section>
<section id="sec-3" >

<h2><span class="section-number-2">3</span> Nanoelektronikk og robotikk</h2>
<p>
Kretsdesign og programmering av maskinvare
</p>

<p>
Krever R1-matte, R2 anbefales
</p>

</section>
<section id="sec-3-1" >

<h3><span class="section-number-3">3.1</span> Hva lærer du?</h3>
<ul class="org-ul">
<li>Elektronikk
</li>
<li>Programmering
</li>
<li>Kinematikk, kretser og signaler
</li>
</ul>
</section>
</section>
<section>
<section id="sec-4" >

<h2><span class="section-number-2">4</span> Programmering og nettverk</h2>
<p>
Utvikling av programvare
</p>

<p>
Krever R1-matte
</p>

</section>
<section id="sec-4-1" >

<h3><span class="section-number-3">4.1</span> Hva lærer du?</h3>
<ul class="org-ul">
<li>Programmering
</li>
<li>Kommunikasjon mellom maskiner
</li>
<li>Hvordan maskiner fungerer og kan brukes effektivt
</li>
</ul>
</section>
</section>
<section>
<section id="sec-5" >

<h2><span class="section-number-2">5</span> Språk og kommunikasjon</h2>
<p>
Utvikling av programvare med fokus på språkbehandling
</p>

</section>
<section id="sec-5-1" >

<h3><span class="section-number-3">5.1</span> Hva lærer du?</h3>
<ul class="org-ul">
<li>Programmering
</li>
<li>Språk, lingvistikk, filosofi eller psykologi
</li>
<li>Hvordan jobbe med menneskelig språk i en maskin
</li>
</ul>
</section>
</section>
</div>
</div>
<script src="./reveal.js/lib/js/head.min.js"></script>
<script src="./reveal.js/js/reveal.min.js"></script>
<script>

        		// Full list of configuration options available here:
        		// https://github.com/hakimel/reveal.js#configuration
        		Reveal.initialize({
        			controls: true,
        			progress: true,
        			history: true,
        			center: true,
        			rollingLinks: true,
        			keyboard: true,
        			overview: true,
        			 // slide width
        			 // slide height
        			 // slide margin
        			 // slide minimum scaling factor
        			 // slide maximum scaling factor


        			theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
        			transition: Reveal.getQueryHash().transition || 'default', // default/cube/page/concave/zoom/linear/fade/none
        			transitionSpeed: 'default',

        			// Optional libraries used to extend on reveal.js
        			dependencies: [
        				{ src: './reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
        				{ src: './reveal.js/plugin/markdown/showdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
        				{ src: './reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
        				{ src: './reveal.js/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } },
        				{ src: './reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
        				{ src: './reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }
        				// { src: './reveal.js/plugin/search/search.js', async: true, condition: function() { return !!document.body.classList; } }
        				// { src: './reveal.js/plugin/remotes/remotes.js', async: true, condition: function() { return !!document.body.classList; } }
        			]
        		});
</script>
</body>
</html>
